In [1]:
import pandas as pd

In [2]:
dados = [10,20,30,40,50]
serie = pd.Series(dados)
serie

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
type(serie)

pandas.core.series.Series

In [5]:
#Criando uma Series com dados de vendas mensais
vendas_mensais = pd.Series(
    [2000,2500,3000,2800,3500,4000,4500,5000,4800,5200,6000,7000],
    index = ['jan', 'fev', 'mar', 'abr', 'mai', 'jun', 'jul', 'ago', 'set', 'out','nov','dez']
)

In [6]:
vendas_mensais

jan    2000
fev    2500
mar    3000
abr    2800
mai    3500
jun    4000
jul    4500
ago    5000
set    4800
out    5200
nov    6000
dez    7000
dtype: int64

In [7]:
#Calculando e exibir a média de vendas
media_vendas = vendas_mensais.mean()
media_vendas

np.float64(4191.666666666667)

In [9]:
#Identificar o mês com maior venda
mes_maior_venda = vendas_mensais.idxmax()
mes_maior_venda

'dez'

In [10]:
#Exibir as vendas acima da média
vendas_acima_media = vendas_mensais[vendas_mensais > media_vendas]
vendas_acima_media

jul    4500
ago    5000
set    4800
out    5200
nov    6000
dez    7000
dtype: int64

In [11]:
dados1 = {
    'Nome': ['Alice', 'Bob', 'Charlie'],
    'Idade': [24,30,22],
    'Cidade': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte']
}

In [12]:
df = pd.DataFrame(dados1)
df

      Nome  Idade          Cidade
0    Alice     24       São Paulo
1      Bob     30  Rio de Janeiro
2  Charlie     22  Belo Horizonte

In [13]:
df.head(1)

    Nome  Idade     Cidade
0  Alice     24  São Paulo

In [14]:
df.tail(1)

      Nome  Idade          Cidade
2  Charlie     22  Belo Horizonte

In [18]:
dados_notas = {
    'Nome': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Matemática': [85,90,78,88,92],
    'Física': [80,75,88,85,95],
    'Química': [78,82,85,80,88]
}

In [19]:
df_notas = pd.DataFrame(dados_notas)
df_notas

      Nome  Matemática  Física  Química
0    Alice          85      80       78
1      Bob          90      75       82
2  Charlie          78      88       85
3    David          88      85       80
4      Eva          92      95       88

In [22]:
#Calculando a média das notas por aluno
df_notas['Média'] = df_notas[['Matemática', 'Física', 'Química']].mean(axis=1)
df_notas

      Nome  Matemática  Física  Química      Média
0    Alice          85      80       78  81.000000
1      Bob          90      75       82  82.333333
2  Charlie          78      88       85  83.666667
3    David          88      85       80  84.333333
4      Eva          92      95       88  91.666667

In [23]:
#Identificar alunos aprovados com nota boa (média >= 82.5)
alunos_aprovados = df_notas[df_notas['Média'] >= 82.5]
alunos_aprovados

      Nome  Matemática  Física  Química      Média
2  Charlie          78      88       85  83.666667
3    David          88      85       80  84.333333
4      Eva          92      95       88  91.666667

In [24]:
#Exibir a média e os alunos aprovados
df_notas[['Nome', 'Média']]

      Nome      Média
0    Alice  81.000000
1      Bob  82.333333
2  Charlie  83.666667
3    David  84.333333
4      Eva  91.666667

In [27]:
alunos_aprovados[['Nome', 'Média']]

      Nome      Média
2  Charlie  83.666667
3    David  84.333333
4      Eva  91.666667